Revit 2027 API
DuctFittingAndAccessoryData.Origin Property
 The origin position of the duct fitting or duct accessory.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ Origin { get; }
Public ReadOnly Property Origin As XYZ
	Get
public:
property XYZ^ Origin {
	XYZ^ get ();
}
member Origin : XYZ with get
Property Value
XYZ
See Also
Reference
DuctFittingAndAccessoryData Class
Autodesk.Revit.DB.Mechanical Namespace